000100 IDENTIFICATION DIVISION.
000150  PROGRAM-ID. hello.
000200  PROCEDURE DIVISION.
000210* THIS IS A COMMENT LINE
000250  DISPLAY "Hello, world!".
000300  STOP RUN.
