      * initialize is used to inialize group items or elementery items
      * strings are set to empty and numerics to 0
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. fn.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000    WORKING-STORAGE SECTION.
000000* 9 - numeric
000000    01 A000 PIC 9(2) VALUE 12.
000000* A - alphabetic
000000    01 A001 PIC X(32) VALUE 'QWER'.
000000 LINKAGE SECTION.
000000 PROCEDURE DIVISION.
000000  DISPLAY 'A000: 'A000.
000000  DISPLAY 'A001: 'A001.
000000  INITIALIZE A000.
000000  INITIALIZE A001.
000000  DISPLAY 'A000: 'A000.
000000  DISPLAY 'A001: 'A001.
000000  EXIT PROGRAM.
