       IDENTIFICATION DIVISION.
       PROGRAM-ID. cobparfloat.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
       DATA DIVISION.
          WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 P000 COMPUTATIONAL-1.
       PROCEDURE DIVISION using P000.
            DISPLAY "----------------------------------------".
            DISPLAY "parfloat()".
            DISPLAY "----------------------------------------".
            DISPLAY P000.
            DISPLAY "----------------------------------------".
            EXIT PROGRAM.

