       IDENTIFICATION DIVISION.
       PROGRAM-ID. cobparlong.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
       DATA DIVISION.
          WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 P000 BINARY-C-LONG.
       PROCEDURE DIVISION using P000.
            DISPLAY "----------------------------------------".
            DISPLAY "parlong()".
            DISPLAY "----------------------------------------".
            DISPLAY P000.
            DISPLAY "----------------------------------------".
            EXIT PROGRAM.

