      * move is used to copy data from a source to a destination
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. fn.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000    WORKING-STORAGE SECTION.
000000    01 I000 PIC 9(2) VALUE 01.
000000    01 I001 PIC 9(2) VALUE 99.
000000    01 S000 PIC X(32) VALUE 'FOO'.
000000    01 S001 PIC X(32) VALUE 'BAR'.
000000    01 STMP PIC X(32) VALUE ''.
000000    01 ITMP PIC X(32) VALUE ''.
000000 LINKAGE SECTION.
000000 PROCEDURE DIVISION.
000000  DISPLAY '----------------------------------------'
000000*------------------------------------------------------------------------
000000*SWAP INT
000000*------------------------------------------------------------------------
000000  DISPLAY 'I000: 'I000.
000000  DISPLAY 'I001: 'I001.
000000  DISPLAY '----------------------------------------'
000000  MOVE I000 TO ITMP.
000000  MOVE I001 TO I000.
000000  MOVE ITMP TO I001.
000000  DISPLAY 'I000: 'I000.
000000  DISPLAY 'I001: 'I001.
000000  DISPLAY '----------------------------------------'
000000*------------------------------------------------------------------------
000000*SWAP STR
000000*------------------------------------------------------------------------
000000  DISPLAY 'S000: 'S000.
000000  DISPLAY 'S001: 'S001.
000000  DISPLAY '----------------------------------------'
000000  MOVE S000 TO STMP.
000000  MOVE S001 TO S000.
000000  MOVE STMP TO S001.
000000  DISPLAY 'S000: 'S000.
000000  DISPLAY 'S001: 'S001.
000000*------------------------------------------------------------------------
000000  DISPLAY '----------------------------------------'
000000  EXIT PROGRAM.
