      * accept is used to get data, stdin
000000 IDENTIFICATION DIVISION.
000000 PROGRAM-ID. fn.
000000 ENVIRONMENT DIVISION.
000000 DATA DIVISION.
000000    WORKING-STORAGE SECTION.
000000* 9 - numeric
000000    01 A000 PIC 9(2) VALUE 1.
000000* A - alphabetic
000000    01 A001 PIC X(32).
000000 LINKAGE SECTION.
000000 PROCEDURE DIVISION.
000000  DISPLAY 'INPUT NUMERIC: '.
000000  ACCEPT A000.
000000  DISPLAY A000.
000000  ACCEPT A001 FROM DATE.
000000  DISPLAY 'DATE: 'A001.
000000  EXIT PROGRAM.
