       IDENTIFICATION DIVISION.
       PROGRAM-ID. cobparvoid.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
       DATA DIVISION.
          WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       PROCEDURE DIVISION.
            DISPLAY "----------------------------------------".
            DISPLAY "cobparvoid()".
            DISPLAY "----------------------------------------".
            EXIT PROGRAM.

