000000 IDENTIFICATION DIVISION.
000100  PROGRAM-ID. hello.
000200  PROCEDURE DIVISION.
000300* DISPLAY IS TAKING A STRING LITERAL
000400  DISPLAY "Some Literal".
000500  DISPLAY 'Some Other Literal'.
000600* HERE ARE SOME NUMERIC LITERALS
000700  DISPLAY 1
000800  DISPLAY -1
000900  DISPLAY +1
001000  DISPLAY 1.1
001100  DISPLAY -1.1
001200  DISPLAY +1.1
001300  STOP RUN.
